In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df_c = pd.read_csv('Customers.csv')
df_p = pd.read_csv('Products.csv')
df_t = pd.read_csv('Transactions.csv')

In [4]:
df_c.head()

  CustomerID        CustomerName         Region  SignupDate
0      C0001    Lawrence Carroll  South America  2022-07-10
1      C0002      Elizabeth Lutz           Asia  2022-02-13
2      C0003      Michael Rivera  South America  2024-03-07
3      C0004  Kathleen Rodriguez  South America  2022-10-09
4      C0005         Laura Weber           Asia  2022-08-15

In [6]:
len(df_c)

200

In [5]:
df_c.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CustomerID    200 non-null    object
 1   CustomerName  200 non-null    object
 2   Region        200 non-null    object
 3   SignupDate    200 non-null    object
dtypes: object(4)
memory usage: 6.4+ KB

In [7]:
df_c.describe()

       CustomerID      CustomerName         Region  SignupDate
count         200               200            200         200
unique        200               200              4         179
top         C0001  Lawrence Carroll  South America  2024-11-11
freq            1                 1             59           3

In [8]:
df_c['Region'].value_counts()

Region
South America    59
Europe           50
North America    46
Asia             45
Name: count, dtype: int64

In [10]:
df_p.head()

  ProductID              ProductName     Category   Price
0      P001     ActiveWear Biography        Books  169.30
1      P002    ActiveWear Smartwatch  Electronics  346.30
2      P003  ComfortLiving Biography        Books   44.12
3      P004            BookWorld Rug   Home Decor   95.69
4      P005          TechPro T-Shirt     Clothing  429.31

In [11]:
df_p.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ProductID    100 non-null    object
 1   ProductName  100 non-null    object
 2   Category     100 non-null    object
 3   Price        100 non-null    float64
dtypes: float64(1), object(3)
memory usage: 3.2+ KB

In [12]:
len(df_p)

100

In [13]:
df_p['Category'].value_counts()

Category
Books          26
Electronics    26
Clothing       25
Home Decor     23
Name: count, dtype: int64

In [14]:
df_p['ProductName'].value_counts()

ProductName
ActiveWear Smartwatch         4
SoundWave Headphones          4
BookWorld Biography           3
TechPro T-Shirt               3
SoundWave Cookbook            3
                             ..
BookWorld Jacket              1
ComfortLiving Smartphone      1
SoundWave T-Shirt             1
ComfortLiving Cookware Set    1
SoundWave Laptop              1
Name: count, Length: 66, dtype: int64

In [16]:
df_p['Price'].describe()

count    100.000000
mean     267.551700
std      143.219383
min       16.080000
25%      147.767500
50%      292.875000
75%      397.090000
max      497.760000
Name: Price, dtype: float64

In [17]:
df_t.head()

,TransactionID,CustomerID,ProductID,TransactionDate,Quantity,TotalValue,Price
0,T00001,C0199,P067,2024-08-25 12:38:23,1,300.68,300.68
1,T00112,C0146,P067,2024-05-27 22:23:54,1,300.68,300.68
2,T00166,C0127,P067,2024-04-25 07:38:55,1,300.68,300.68
3,T00272,C0087,P067,2024-03-26 22:55:37,2,601.36,300.68
4,T00363,C0070,P067,2024-03-21 15:10:10,3,902.04,300.68

In [18]:
len(df_t)

1000

In [19]:
df_t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   TransactionID    1000 non-null   object
 1   CustomerID       1000 non-null   object
 2   ProductID        1000 non-null   object
 3   TransactionDate  1000 non-null   object
 4   Quantity         1000 non-null   int64
 5   TotalValue       1000 non-null   float64
 6   Price            1000 non-null   float64
dtypes: float64(2), int64(1), object(4)
memory usage: 54.8+ KB

In [21]:
df_t['CustomerID'].value_counts()

CustomerID
C0109    11
C0156    11
C0141    10
C0175    10
C0065    10
         ..
C0058     1
C0014     1
C0151     1
C0078     1
C0110     1
Name: count, Length: 199, dtype: int64

In [22]:
df_t['ProductID'].value_counts()

ProductID
P059    19
P029    17
P062    16
P079    16
P054    16
        ..
P024     5
P014     4
P031     4
P044     4
P099     4
Name: count, Length: 100, dtype: int64

In [23]:
df_t['Quantity'].value_counts()

Quantity
4    261
3    254
2    246
1    239
Name: count, dtype: int64

In [25]:
df_t['TotalValue'].describe()

count    1000.000000
mean      689.995560
std       493.144478
min        16.080000
25%       295.295000
50%       588.880000
75%      1011.660000
max      1991.040000
Name: TotalValue, dtype: float64

In [26]:
df_t['Price'].describe()

count    1000.00000
mean      272.55407
std       140.73639
min        16.08000
25%       147.95000
50%       299.93000
75%       404.40000
max       497.76000
Name: Price, dtype: float64

In [27]:
type(df_c['SignupDate'])

pandas.core.series.Series

In [28]:
type(df_t['TransactionDate'])

pandas.core.series.Series

In [32]:
category_info = df_p.groupby("Category")["Price"].agg(["mean", "min", "max"])
category_info

                   mean    min     max
Category
Books        292.212308  33.59  497.76
Clothing     263.720000  18.82  481.78
Electronics  275.353462  16.08  459.86
Home Decor   235.020000  41.18  454.53

In [34]:
c_t_merge = df_t.merge(df_c, on="CustomerID")
c_t_p_merge = c_t_merge.merge(df_p, on="ProductID")

In [35]:
c_t_p_merge

,TransactionID,CustomerID,ProductID,TransactionDate,Quantity,TotalValue,Price_x,CustomerName,Region,SignupDate,ProductName,Category,Price_y
0,T00001,C0199,P067,2024-08-25 12:38:23,1,300.68,300.68,Andrea Jenkins,Europe,2022-12-03,ComfortLiving Bluetooth Speaker,Electronics,300.68
1,T00112,C0146,P067,2024-05-27 22:23:54,1,300.68,300.68,Brittany Harvey,Asia,2024-09-04,ComfortLiving Bluetooth Speaker,Electronics,300.68
2,T00166,C0127,P067,2024-04-25 07:38:55,1,300.68,300.68,Kathryn Stevens,Europe,2024-04-04,ComfortLiving Bluetooth Speaker,Electronics,300.68
3,T00272,C0087,P067,2024-03-26 22:55:37,2,601.36,300.68,Travis Campbell,South America,2024-04-11,ComfortLiving Bluetooth Speaker,Electronics,300.68
4,T00363,C0070,P067,2024-03-21 15:10:10,3,902.04,300.68,Timothy Perez,Europe,2022-03-15,ComfortLiving Bluetooth Speaker,Electronics,300.68
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,T00630,C0031,P093,2024-10-08 23:58:14,2,609.88,304.94,Tina Miller,South America,2024-04-11,TechPro Vase,Home Decor,304.94
996,T00672,C0165,P044,2024-07-28 00:09:49,4,75.28,18.82,Juan Mcdaniel,South America,2022-04-09,ActiveWear Running Shoes,Clothing,18.82
997,T00711,C0165,P044,2024-06-11 15:51:14,4,75.28,18.82,Juan Mcdaniel,South America,2022-04-09,ActiveWear Running Shoes,Clothing,18.82
998,T00878,C0165,P044,2024-09-24 21:15:21,3,56.46,18.82,Juan Mcdaniel,South America,2022-04-09,ActiveWear Running Shoes,Clothing,18.82
999,T00157,C0169,P044,2024-11-09 09:07:36,2,37.64,18.82,Jennifer Shaw,South America,2023-04-13,ActiveWear Running Shoes,Clothing,18.82

In [38]:
c_t_p_merge = c_t_p_merge.drop('Price_y', axis=1)
c_t_p_merge = c_t_p_merge.rename(columns={'Price_x': 'Price'})

In [39]:
c_t_p_merg

,TransactionID,CustomerID,ProductID,TransactionDate,Quantity,TotalValue,Price,CustomerName,Region,SignupDate,ProductName,Category
0,T00001,C0199,P067,2024-08-25 12:38:23,1,300.68,300.68,Andrea Jenkins,Europe,2022-12-03,ComfortLiving Bluetooth Speaker,Electronics
1,T00112,C0146,P067,2024-05-27 22:23:54,1,300.68,300.68,Brittany Harvey,Asia,2024-09-04,ComfortLiving Bluetooth Speaker,Electronics
2,T00166,C0127,P067,2024-04-25 07:38:55,1,300.68,300.68,Kathryn Stevens,Europe,2024-04-04,ComfortLiving Bluetooth Speaker,Electronics
3,T00272,C0087,P067,2024-03-26 22:55:37,2,601.36,300.68,Travis Campbell,South America,2024-04-11,ComfortLiving Bluetooth Speaker,Electronics
4,T00363,C0070,P067,2024-03-21 15:10:10,3,902.04,300.68,Timothy Perez,Europe,2022-03-15,ComfortLiving Bluetooth Speaker,Electronics
...,...,...,...,...,...,...,...,...,...,...,...,...
995,T00630,C0031,P093,2024-10-08 23:58:14,2,609.88,304.94,Tina Miller,South America,2024-04-11,TechPro Vase,Home Decor
996,T00672,C0165,P044,2024-07-28 00:09:49,4,75.28,18.82,Juan Mcdaniel,South America,2022-04-09,ActiveWear Running Shoes,Clothing
997,T00711,C0165,P044,2024-06-11 15:51:14,4,75.28,18.82,Juan Mcdaniel,South America,2022-04-09,ActiveWear Running Shoes,Clothing
998,T00878,C0165,P044,2024-09-24 21:15:21,3,56.46,18.82,Juan Mcdaniel,South America,2022-04-09,ActiveWear Running Shoes,Clothing
999,T00157,C0169,P044,2024-11-09 09:07:36,2,37.64,18.82,Jennifer Shaw,South America,2023-04-13,ActiveWear Running Shoes,Clothing

In [40]:
regional_sale = c_t_p_merge.groupby("Region")["Price"].agg(["sum", "mean", "min", "max"])
regional_sale

                    sum        mean    min     max
Region
Asia           59140.03  271.284541  26.26  497.76
Europe         64483.15  275.569017  26.26  497.76
North America  64719.07  265.242090  16.08  497.76
South America  84211.82  277.012566  16.08  497.76

In [46]:
highest_sale_region = regional_sale.sort_values(by="sum", ascending=False).index.to_list()
highest_sale_region

['South America', 'North America', 'Europe', 'Asia']

In [120]:
product_sales_by_region = c_t_p_merge.groupby(["Region", "ProductID", "ProductName"])["Price"].sum().reset_index(name="TotalSales")
top_products_by_region = product_sales_by_region.loc[product_sales_by_region.groupby("Region")["TotalSales"].idxmax()]
top_products_by_region

            Region ProductID            ProductName  TotalSales
68            Asia      P076       ActiveWear Jeans     2146.45
152         Europe      P079         ActiveWear Rug     2086.85
249  North America      P083  ActiveWear Smartwatch     2734.32
292  South America      P029     TechPro Headphones     3469.12

In [51]:
category_sales_by_region = c_t_p_merge.groupby(["Region", "Category"])["Price"].sum().reset_index(name="TotalSales")

In [121]:
top_categories_by_region = category_sales_by_region.loc[category_sales_by_region.groupby("Region")["TotalSales"].idxmax()]
top_categories_by_region

           Region  Category  TotalSales
1            Asia  Clothing    17200.90
4          Europe     Books    18557.69
8   North America     Books    18135.24
12  South America     Books    25409.46

In [56]:
c_t_p_merge['TransactionDate'] = pd.to_datetime(c_t_p_merge['TransactionDate']) 

c_t_p_merge['TransactionMonth'] = c_t_p_merge['TransactionDate'].dt.month
monthly_product_sales = c_t_p_merge.groupby(["ProductID", "ProductName", "TransactionMonth"])["Price"].sum().reset_index(name="MonthlySales")

In [57]:
monthly_product_sales

    ProductID             ProductName  TransactionMonth  MonthlySales
0        P001    ActiveWear Biography                 1        169.30
1        P001    ActiveWear Biography                 5        338.60
2        P001    ActiveWear Biography                 6        169.30
3        P001    ActiveWear Biography                 8        338.60
4        P001    ActiveWear Biography                 9        169.30
..        ...                     ...               ...           ...
681      P099  SoundWave Mystery Book                 8        354.29
682      P100       HomeSense Sweater                 3        252.68
683      P100       HomeSense Sweater                 4        126.34
684      P100       HomeSense Sweater                 7        252.68
685      P100       HomeSense Sweater                 8        126.34

[686 rows x 4 columns]

In [117]:
customer_transactions = c_t_p_merge.groupby('CustomerID')['TransactionID'].nunique().reset_index()
customer_transactions.columns = ['CustomerID', 'TransactionCount']

In [118]:
customer_transactions['CustomerType'] = customer_transactions['TransactionCount'].apply(lambda x: 'Returning' if x > 1 else 'New')

In [119]:
customer_type_counts = customer_transactions['CustomerType'].value_counts()
customer_type_counts

CustomerType
Returning    187
New           12
Name: count, dtype: int64

In [115]:
category_sales = c_t_p_merge.groupby('Category')['TotalValue'].sum().reset_index()
category_sales = category_sales.sort_values(by='TotalValue', ascending=False)
category_sales

      Category  TotalValue
0        Books   192147.47
2  Electronics   180783.50
1     Clothing   166170.66
3   Home Decor   150893.93

In [116]:
region_aov = c_t_p_merge.groupby('Region').apply(lambda x: x['TotalValue'].sum() / x['TransactionID'].nunique()).reset_index()
region_aov.columns = ['Region', 'average_order_value']
region_aov

          Region  average_order_value
0           Asia           697.591606
1         Europe           710.489872
2  North America           624.235246
3  South America           721.554474

In [103]:
customer_spending = c_t_p_merge.groupby(['CustomerID', 'Region'])['TotalValue'].sum().reset_index()
customer_spending.columns = ['CustomerID', 'Region', 'TotalSpend']

In [105]:
max_spend = customer_spending['TotalSpend'].max()
min_spend = customer_spending['TotalSpend'].min()
high_value_threshold = 0.50 * max_spend
low_value_threshold = min_spend + 0.10 * min_spend

In [106]:
def categorize_customer(spend):
    if spend > high_value_threshold:
        return 'High-Value'
    elif spend <= low_value_threshold:
        return 'Low-Value'
    else:
        return 'Mid-Value'

In [107]:
customer_spending['CustomerType'] = customer_spending['TotalSpend'].apply(categorize_customer)

In [108]:
regional_customer_counts = customer_spending.groupby(['Region', 'CustomerType']).size().reset_index(name='Count')

In [109]:
regional_customer_counts

          Region CustomerType  Count
0           Asia   High-Value     10
1           Asia    Mid-Value     34
2         Europe   High-Value      5
3         Europe    Low-Value      1
4         Europe    Mid-Value     44
5  North America   High-Value      6
6  North America    Mid-Value     40
7  South America   High-Value     13
8  South America    Mid-Value     46

In [110]:
regional_high_low_counts = regional_customer_counts[regional_customer_counts['CustomerType'].isin(['High-Value', 'Low-Value'])]

In [111]:
regional_high_low_counts

          Region CustomerType  Count
0           Asia   High-Value     10
2         Europe   High-Value      5
3         Europe    Low-Value      1
5  North America   High-Value      6
7  South America   High-Value     13